БухЭксп/Catalogs/CW_ДоходыНерезидентовСведенияОДоходах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ДоходыНерезидентовСведенияОДоходах</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеРаздел42</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеТабличногоДокумента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ДоходыНерезидентовЯчейкиРаздела</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ДоходыНерезидентовСведенияОДоходах/Forms/ФормаЗаполнения/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресРезультата") 
		И ЭтоАдресВременногоХранилища(Параметры.АдресРезультата) Тогда
		ТаблицаДокументов.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресРезультата));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПродолжить(Команда)
	
	ТекущаяСтрока = Элементы.ТаблицаДокументов.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьВыборСтрокиНаКлиенте(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗавершитьВыборСтрокиНаКлиенте(ВыбраннаяСтрока);
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьВыборСтрокиНаКлиенте(ВыбраннаяСтрока)
	
	СтрокаТекущая = ТаблицаДокументов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Структура = Новый Структура;
	Структура.Вставить("Период", 				СтрокаТекущая.Период);
	Структура.Вставить("Контрагент", 			СтрокаТекущая.Контрагент);
	Структура.Вставить("ДоговорКонтрагента", 	СтрокаТекущая.ДоговорКонтрагента);
	Структура.Вставить("Валюта", 				СтрокаТекущая.Валюта);
	Структура.Вставить("СуммаПоДокументу", 		СтрокаТекущая.СуммаПоДокументу);
	       
	ЭтаФорма.Закрыть(Структура);
	
КонецПроцедуры
